[
   {
      "picture": "https://m.media-amazon.com/images/I/81KDL-G2nRL._AC_SL1500_.jpg",
      "name": "Remote Control Sports Car",
      "subCategory": [
         "Remote Control Cars",
         "Sports Cars",
         "Electric Cars"
      ],
      "sellerName": "Jhn D Rastoda",
      "sellerEmail": "info@speedytoys.com",
      "price": 49.99,
      "rating": 4.5,
      "availableQuantity": 10,
      "details": "Experience the thrill of racing with the Remote Control Sports Car. This high-speed remote control car is perfect for car enthusiasts and young racers. With its sleek design and powerful motor, this car delivers lightning-fast speeds and precise control. The remote control allows you to maneuver the car in any direction, perform sharp turns, and even drift around corners. The Remote Control Sports Car features durable construction and realistic detailing, making it a must-have for any car collection. Whether you're competing in races or performing stunts, this car guarantees hours of exhilarating fun. Get behind the wheel, unleash your inner racer, and conquer the track with the Remote Control Sports Car."
   },
   {
      "picture": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T1/images/I/71rS5LD7b7L._AC_SL1500_.jpg",
      "name": "Construction Truck Set",
      "subCategory": [
         "Construction Toys",
         "Trucks",
         "Play Vehicles"
      ],
      "sellerName": "Micle Clark",
      "sellerEmail": "sales@builditup.com",
      "price": 29.99,
      "rating": 4.2,
      "availableQuantity": 8,
      "details": "Let your little one's imagination soar with the Construction Truck Set. This set includes a collection of realistic construction trucks, including a dump truck, bulldozer, and excavator. Each truck features movable parts and sturdy construction, allowing kids to engage in imaginative play and create their own construction sites. The set is perfect for developing fine motor skills, hand-eye coordination, and cognitive abilities. Whether they're loading and unloading materials, clearing debris, or building structures, kids will have a blast playing with these detailed trucks. The Construction Truck Set is built to withstand hours of play and provides endless opportunities for creative fun."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/81uxyqIdx1L.jpg",
      "name": "Race Track Set",
      "subCategory": [
         "Race Tracks",
         "Car Tracks",
         "Playsets"
      ],
      "sellerName": "David Watson",
      "sellerEmail": "info@speedytracks.com",
      "price": 59.99,
      "rating": 4.7,
      "availableQuantity": 6,
      "details": "Get ready for high-speed racing action with the Race Track Set. This set includes a dynamic race track, complete with loops, curves, and straightaways. The set also features two race cars with adjustable speeds, allowing kids to compete in thrilling races. The track is easy to assemble and can be customized to create different layouts and challenges. Race against friends or beat your own record as you master the track's twists and turns. The Race Track Set provides endless entertainment and helps develop hand-eye coordination, spatial awareness, and problem-solving skills. Start your engines, buckle up, and race to the finish line with this exciting toy."
   },
   {
      "picture": "https://static-01.daraz.com.bd/p/a0ec1fe85ae3c884ec29ad6def184fdc.jpg_720x720.jpg_.webp",
      "name": "Monster Truck",
      "subCategory": [
         "Monster Trucks",
         "Off-Road Vehicles",
         "Toy Trucks"
      ],
      "sellerName": "D k Suja",
      "sellerEmail": "sales@monsterwheels.com",
      "price": 39.99,
      "rating": 4.6,
      "availableQuantity": 12,
      "details": "Conquer any terrain with the Monster Truck. This rugged and powerful toy truck is designed to tackle off-road adventures and perform jaw-dropping stunts. Its oversized wheels and suspension system allow it to navigate through rough surfaces, while its durable frame can withstand high-impact landings and crashes. The Monster Truck features a realistic design with vibrant colors and intricate detailing. Whether you're racing, jumping over obstacles, or crushing through obstacles, this truck guarantees hours of action-packed fun. Let your imagination run wild and create your own monster truck shows and competitions. Get behind the wheel, rev the engine, and unleash the power of the Monster Truck."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/910i-6BN5LL.jpg",
      "name": "Police Car Set",
      "subCategory": [
         "Police Toys",
         "Car Sets",
         "Emergency Vehicles"
      ],
      "sellerName": "MM B Arkand",
      "sellerEmail": "info@copcarsunlimited.com",
      "price": 34.99,
      "rating": 4.3,
      "availableQuantity": 9,
      "details": "Protect and serve with the Police Car Set. This set includes a collection of police cars and accessories, allowing kids to embark on exciting law enforcement missions. The set features realistic police car designs with working lights and sounds. Kids can imagine themselves patrolling the streets, chasing down criminals, and maintaining law and order. The Police Car Set encourages imaginative play, social interaction, and the development of problem-solving skills. Whether they're responding to emergencies or solving crimes, kids will feel like real police officers with this engaging toy. Equip your little ones with the Police Car Set and let their imaginations soar."
   },
   {
      "picture": "https://images-cdn.ubuy.co.in/633a9ce118bb2e5d093c4a9a-rlaarlo-rc-cars-1-14-remote-control-car.jpg",
      "name": "RC Off-Road Buggy",
      "subCategory": [
         "Remote Control Cars",
         "Off-Road Vehicles",
         "Electric Cars"
      ],
      "sellerName": "Batida rr",
      "sellerEmail": "sales@extremerc.com",
      "price": 69.99,
      "rating": 4.8,
      "availableQuantity": 7,
      "details": "Experience off-road excitement with the RC Off-Road Buggy. This remote control car is built to conquer tough terrains and deliver thrilling performance. With its four-wheel drive and powerful motor, it can navigate through sand, mud, and rocky surfaces with ease. The buggy's responsive controls and adjustable suspension allow for precise handling and impressive jumps. The RC Off-Road Buggy features a durable design with a sleek body and vibrant colors. Whether you're racing against friends or performing gravity-defying tricks, this buggy guarantees adrenaline-pumping fun. Unleash the power of off-road racing and take your driving skills to new heights with the RC Off-Road Buggy."
   },
   {
      "picture": "https://m.media-amazon.com/images/W/IMAGERENDERING_521856-T1/images/I/81cNXVVbMLL._AC_SL1500_.jpg",
      "name": "Fire Truck",
      "subCategory": [
         "Fire Trucks",
         "Emergency Vehicles",
         "Toy Trucks"
      ],
      "sellerName": "Bill K D",
      "sellerEmail": "info@firerescuetoys.com",
      "price": 44.99,
      "rating": 4.5,
      "availableQuantity": 11,
      "details": "Sound the alarm and save the day with the Fire Truck. This toy fire truck is equipped with lights, sounds, and realistic features, making it the perfect addition to any rescue mission. Kids can imagine themselves as brave firefighters, rushing to extinguish fires and rescue people in need. The Fire Truck features a retractable ladder, water hose, and detailed interior, adding to the authenticity of the play experience. It promotes imaginative play, role-playing, and the development of fine motor skills. Whether they're organizing firefighting operations or responding to emergencies, kids will have a blast with this interactive toy. Let their heroic adventures unfold with the Fire Truck."
   },
   {
      "picture": "https://images-na.ssl-images-amazon.com/images/I/51jxC3MgBKL._UL500_.jpg",
      "name": "Race Car Track Set",
      "subCategory": [
         "Race Tracks",
         "Car Tracks",
         "Playsets"
      ],
      "sellerName": "Liton K",
      "sellerEmail": "sales@speedcircuit.com",
      "price": 49.99,
      "rating": 4.7,
      "availableQuantity": 8,
      "details": "Experience the excitement of racing with the Race Car Track Set. This set features a multi-level race track with loops, curves, and a high-speed straightaway. It also includes two race cars with realistic designs and adjustable speeds. The track can be easily assembled and customized to create different racing challenges. Kids can compete against friends or race against the clock, honing their racing skills and improving their hand-eye coordination. The Race Car Track Set encourages imaginative play, social interaction, and friendly competition. Rev your engines, accelerate through the track, and cross the finish line in victory with this thrilling toy."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/61y00xvqQCL._SL1000_.jpg",
      "name": "Diecast Muscle Car Collection",
      "subCategory": [
         "Diecast Cars",
         "Muscle Cars",
         "Collectible Cars"
      ],
      "sellerName": "Rony Roy",
      "sellerEmail": "info@classicrides.com",
      "price": 39.99,
      "rating": 4.4,
      "availableQuantity": 13,
      "details": "Take a trip back in time with the Diecast Muscle Car Collection. This collection features a set of highly-detailed diecast muscle cars from various eras, including iconic models like the Ford Mustang, Chevrolet Camaro, and Dodge Charger. Each car is meticulously crafted with authentic details and vibrant paintwork. The Diecast Muscle Car Collection is perfect for car enthusiasts, collectors, and fans of classic American muscle cars. Display them in your collection, recreate historical car scenes, or simply appreciate their timeless design. These diecast cars make great gifts and are sure to impress any car lover. Start your collection and celebrate the power and beauty of muscle cars with this remarkable set."
   },
   {
      "picture": "https://rukminim1.flixcart.com/image/800/800/jjiw1ow0/remote-control-toy/n/e/r/remote-controlled-rock-crawler-rc-monster-truck-4wd-off-road-original-imaf7fr8zkxfs5cg.jpeg?q=90",
      "name": "RC Monster Truck",
      "subCategory": [
         "Remote Control Cars",
         "Monster Trucks",
         "Electric Cars"
      ],
      "sellerName": "Mega Mehrin",
      "sellerEmail": "sales@megawheels.com",
      "price": 59.99,
      "rating": 4.6,
      "availableQuantity": 9,
      "details": "Conquer any terrain with the RC Monster Truck. This powerful remote control truck is designed to handle rough off-road conditions and perform impressive stunts. Its oversized wheels and high-clearance suspension system allow it to traverse obstacles with ease. The RC Monster Truck features a durable and rugged design, ensuring it can withstand the toughest challenges. With its responsive controls and high-speed performance, this truck is perfect for adrenaline junkies and off-road enthusiasts. Whether you're climbing over rocks, jumping ramps, or racing against friends, the RC Monster Truck delivers thrilling entertainment. Get ready to unleash the beast and dominate the off-road with this incredible toy."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/91aVOFkXTBL._AC_SL1500_.jpg",
      "name": "Car Transporter Truck",
      "subCategory": [
         "Trucks",
         "Play Vehicles",
         "Toy Trucks"
      ],
      "sellerName": "Saiful Ati",
      "sellerEmail": "info@toyhaulers.com",
      "price": 34.99,
      "rating": 4.3,
      "availableQuantity": 10,
      "details": "Transport and deliver cars with the Car Transporter Truck. This toy truck features a detachable trailer with multiple levels to accommodate various cars. It also includes several mini toy cars that can be loaded and unloaded onto the trailer. The Car Transporter Truck promotes imaginative play, problem-solving, and fine motor skills as kids plan and execute their car transportation missions. The truck is made from sturdy materials, ensuring durability and long-lasting play. Whether they're pretending to be a professional car hauler or organizing their own car show, kids will enjoy hours of fun with the Car Transporter Truck."
   },
   {
      "picture": "https://i.ebayimg.com/images/g/2V0AAOSwVSFfF-iO/s-l1600.jpg",
      "name": "Formula 1 Racing Set",
      "subCategory": [
         "Race Tracks",
         "Formula 1",
         "Playsets"
      ],
      "sellerName": "Kasanda Baital",
      "sellerEmail": "sales@speedcircuit.com",
      "price": 69.99,
      "rating": 4.7,
      "availableQuantity": 7,
      "details": "Experience the speed and precision of Formula 1 racing with the Formula 1 Racing Set. This set features a realistic race track with intricate details, including curves, straights, and pit stops. It also includes two Formula 1 race cars with aerodynamic designs and adjustable speeds. The track can be easily assembled, and additional accessories such as grandstands and barriers can be added for a more immersive racing experience. Kids can compete against friends, simulate professional races, or create their own racing leagues. The Formula 1 Racing Set promotes strategic thinking, hand-eye coordination, and friendly competition. Step into the world of Formula 1 and become a racing champion with this thrilling toy."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/71PZDQ1LbzL._AC_SY355_.jpg",
      "name": "Off-Road Adventure Set",
      "subCategory": [
         "Off-Road Vehicles",
         "Adventure Sets",
         "Playsets"
      ],
      "sellerName": "Roy Kaur",
      "sellerEmail": "info@adventuretoys.com",
      "price": 54.99,
      "rating": 4.6,
      "availableQuantity": 8,
      "details": "Embark on an off-road adventure with the Off-Road Adventure Set. This set includes a rugged off-road vehicle, a trailer, and various accessories to create an exciting outdoor play experience. The off-road vehicle features realistic details, including working suspension, opening doors, and a removable roof. The trailer can be attached to the vehicle to transport additional toys or equipment. The Off-Road Adventure Set encourages imaginative play, problem-solving, and outdoor exploration. Kids can create their own wilderness expeditions, navigate challenging terrains, and overcome obstacles. Whether they're going camping, exploring nature, or embarking on rescue missions, this set provides endless possibilities for outdoor fun and creativity."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/51jTMuoRkkL._AC_SY780_.jpg",
      "name": "Stunt Car Set",
      "subCategory": [
         "Stunt Cars",
         "Play Vehicles",
         "Toy Sets"
      ],
      "sellerName": "S K Salman",
      "sellerEmail": "info@stuntmasters.com",
      "price": 39.99,
      "rating": 4.5,
      "availableQuantity": 9,
      "details": "Prepare for jaw-dropping stunts with the Stunt Car Set. This set includes two stunt cars and a variety of stunt accessories to create thrilling and daring performances. The cars feature special mechanisms that enable them to perform flips, spins, and gravity-defying jumps. The set also includes ramps, loops, and obstacles that can be arranged to create different stunt courses. The Stunt Car Set promotes creativity, problem-solving, and coordination as kids design their own daredevil shows. Whether they're performing acrobatic flips, jumping through flaming hoops, or conquering challenging obstacles, this set guarantees hours of action-packed entertainment. Unleash the stunt driver within and create epic stunt spectacles with the Stunt Car Set."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/71BkMiYDwML.jpg",
      "name": "Emergency Response Vehicle Set",
      "subCategory": [
         "Emergency Vehicles",
         "Play Vehicles",
         "Rescue Sets"
      ],
      "sellerName": "Reia Ridika",
      "sellerEmail": "info@rescueheroes.com",
      "price": 49.99,
      "rating": 4.4,
      "availableQuantity": 11,
      "details": "Be a hero and save the day with the Emergency Response Vehicle Set. This set includes a collection of emergency vehicles, including a police car, fire truck, and ambulance. Each vehicle is equipped with lights, sounds, and realistic features to enhance the play experience. Kids can imagine themselves as brave first responders, rushing to emergencies and providing assistance. The Emergency Response Vehicle Set promotes imaginative play, empathy, and the development of social skills. Whether they're responding to accidents, fighting fires, or aiding injured individuals, kids will feel like real-life heroes with this engaging toy. Equip your little ones with the Emergency Response Vehicle Set and let their heroic adventures begin."
   },
   {
      "picture": "https://images-cdn.ubuy.co.in/633ae7f2f458a144c3447a42-remote-control-car-x-toyz-high-speed.jpg",
      "name": "RC Drift Car",
      "subCategory": [
         "Remote Control Cars",
         "Drift Cars",
         "Electric Cars"
      ],
      "sellerName": "B Bond",
      "sellerEmail": "sales@driftkings.com",
      "price": 59.99,
      "rating": 4.8,
      "availableQuantity": 7,
      "details": "Experience the art of drifting with the RC Drift Car. This remote control car is specially designed for precise control and high-performance drifting. Its low-profile tires, adjustable suspension, and rear-wheel drive system allow for impressive drifts and sharp turns. The RC Drift Car features a sleek and aerodynamic design with vibrant paintwork, making it visually appealing as it slides and glides across surfaces. Whether you're competing in drift battles or practicing your skills, this car guarantees hours of thrilling entertainment. Perfect your drifting techniques, master the art of controlled slides, and become the ultimate drift king with the RC Drift Car."
   },
   {
      "picture": "https://www.hamleys.com/media/catalog/product/7/6/761742_alt5_5iepx0ijtxzntcjr.jpg?quality=80&bg-color=255,255,255&fit=bounds&height=&width=&canvas=:",
      "name": "Car Wash Playset",
      "subCategory": [
         "Playsets",
         "Car Sets",
         "Imaginative Play"
      ],
      "sellerName": "Tommy Cruise",
      "sellerEmail": "info@playtimefun.com",
      "price": 34.99,
      "rating": 4.3,
      "availableQuantity": 10,
      "details": "Bring your cars in for a squeaky clean at the Car Wash Playset. This playset features a car wash station with movable brushes, water sprayers, and a drying station. It also includes several toy cars for a complete car wash experience. Kids can simulate the process of washing, rinsing, and drying their cars, promoting imaginative play and fine motor skills. The Car Wash Playset is made from durable materials and can be easily assembled. Whether they're running a car wash business, maintaining their toy car fleet, or role-playing as car owners, kids will have a blast with this interactive playset. Keep your toy cars spotless and sparkling with the Car Wash Playset."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/81wWMPHIy+L.jpg",
      "name": "Monster Jam Grave Digger",
      "subCategory": [
         "Monster Trucks",
         "Play Vehicles",
         "Outdoor Toys"
      ],
      "sellerName": "Jason Bourne",
      "sellerEmail": "info@monsterjam.com",
      "price": 49.99,
      "rating": 4.7,
      "availableQuantity": 8,
      "details": "Experience the thrill of Monster Jam with the Grave Digger monster truck. This officially licensed toy replica of the famous Grave Digger monster truck features a detailed design with authentic graphics and oversized wheels. It can perform high jumps, crush obstacles, and conquer any terrain. The Grave Digger monster truck is perfect for outdoor play and encourages imaginative monster truck adventures. Whether you're organizing your own Monster Jam shows, competing in freestyle events, or embarking on wild monster truck expeditions, this toy guarantees hours of adrenaline-pumping fun. Unleash the power of the Grave Digger and become a legendary monster truck driver."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/8165tYYE6oL._AC_SL1500_.jpg",
      "name": "Construction Vehicle Set",
      "subCategory": [
         "Construction Toys",
         "Play Vehicles",
         "Toy Sets"
      ],
      "sellerName": "Michle Andam",
      "sellerEmail": "sales@constructionzone.com",
      "price": 39.99,
      "rating": 4.6,
      "availableQuantity": 9,
      "details": "Build, dig, and transport with the Construction Vehicle Set. This set includes a collection of construction vehicles, including a bulldozer, excavator, and dump truck. Each vehicle features realistic details and movable parts, allowing kids to simulate construction tasks. The set also includes accessories such as construction cones and barrels for a more immersive play experience. The Construction Vehicle Set promotes imaginative play, fine motor skills, and hand-eye coordination. Kids can create their own construction sites, dig trenches, and transport materials. Whether they're building structures, repairing roads, or creating their own construction projects, this set provides endless possibilities for constructive play."
   },
   {
      "picture": "https://m.media-amazon.com/images/I/51F7tfXUJFL.jpg",
      "name": "Remote Control Speedboat",
      "subCategory": [
         "Remote Control Boats",
         "Water Toys",
         "Outdoor Toys"
      ],
      "sellerName": "Segala D Bhula",
      "sellerEmail": "info@aquaticadventures.com",
      "price": 59.99,
      "rating": 4.5,
      "availableQuantity": 11,
      "details": "Make a splash with the Remote Control Speedboat. This high-speed remote control boat is designed for thrilling water adventures. It features a sleek and aerodynamic design with powerful motors that propel it across lakes, ponds, and pools. The remote control allows for precise steering and speed control, providing an exhilarating experience for boat enthusiasts. The Remote Control Speedboat is made from durable materials and is water-resistant, ensuring it can withstand the rigors of water play. Whether you're racing against friends, performing daring maneuvers, or simply enjoying a leisurely cruise, this speedboat guarantees hours of aquatic fun. Set sail and explore the waters with the Remote Control Speedboat."
   }
]