[
   {
      "toyName": "Vintage Red Convertible",
      "picture": "https://cdn.vintagekeepsakes.com.au/wp-content/uploads/2021/05/IMG_6206-scaled.jpg",
      "price": 49.99,
      "rating": 4.5,
      "category": "vintage-toy-cars",
      "subCategory": "pickups",
      "details": "Experience the allure of the open road with the Vintage Red Convertible toy car. This classic beauty features a vibrant red color that catches the eye and a convertible top that adds a touch of elegance. The meticulous attention to detail, from the chrome accents to the finely crafted interior, makes it a prized possession for collectors and car enthusiasts alike. Whether you're cruising along coastal highways or reimagining scenes from the golden era of motoring, the Vintage Red Convertible will transport you to a bygone era of glamour and adventure. With its smooth handling and timeless design, this toy car is sure to delight both children and adults. Experience the allure of the open road with the Vintage Red Convertible toy car. This classic beauty features a vibrant red color that catches the eye and a convertible top that adds a touch of elegance. The meticulous attention to detail, from the chrome accents to the finely crafted interior, makes it a prized possession for collectors and car enthusiasts alike. Whether you're cruising along coastal highways or reimagining scenes from the golden era of motoring, the Vintage Red Convertible will transport you to a bygone era of glamour and adventure. With its smooth handling and timeless design, this toy car is sure to delight both children and adults."
   },
   {
      "toyName": "Racing Speedster",
      "picture": "https://cdn.shopify.com/s/files/1/2525/8672/products/hipkids-ride-on-steel-racer-push-car-30611986710662_1000x.jpg?v=1666640490",
      "price": 59.99,
      "rating": 4.7,
      "category": "racing-toy-cars",
      "subCategory": "speedsters",
      "details": "Feel the adrenaline rush of high-speed racing with the Racing Speedster toy car. Designed for pure performance, this sleek and aerodynamic speedster features a streamlined body and a powerful engine that will leave your competitors in the dust. The precision controls and responsive handling allow you to navigate every turn with ease, while the attention-grabbing design ensures you'll stand out on the racetrack. Whether you're competing in official races or organizing your own thrilling challenges, the Racing Speedster is built to deliver unmatched speed and excitement. Feel the adrenaline rush of high-speed racing with the Racing Speedster toy car. Designed for pure performance, this sleek and aerodynamic speedster features a streamlined body and a powerful engine that will leave your competitors in the dust. The precision controls and responsive handling allow you to navigate every turn with ease, while the attention-grabbing design ensures you'll stand out on the racetrack. Whether you're competing in official races or organizing your own thrilling challenges, the Racing Speedster is built to deliver unmatched speed and excitement."
   },
   {
      "toyName": "Off-Road Warrior",
      "picture": "https://m.media-amazon.com/images/I/81Fh5qPlC2L.jpg",
      "price": 69.99,
      "rating": 4.6,
      "category": "off-road-toy-cars",
      "subCategory": "warriors",
      "details": "Prepare for off-road adventures like never before with the Off-Road Warrior toy car. This rugged and fearless warrior is equipped with all the features needed to conquer any terrain. Its reinforced body, heavy-duty suspension, and oversized tires provide unmatched durability and traction. Whether you're tackling rocky mountainsides or plowing through muddy trails, the Off-Road Warrior will fearlessly lead the way. The attention to detail, from the realistic exterior design to the intricately designed interior, adds to the immersive off-road experience. Get ready to unleash the inner warrior and embark on thrilling off-road journeys! Prepare for off-road adventures like never before with the Off-Road Warrior toy car. This rugged and fearless warrior is equipped with all the features needed to conquer any terrain. Its reinforced body, heavy-duty suspension, and oversized tires provide unmatched durability and traction. Whether you're tackling rocky mountainsides or plowing through muddy trails, the Off-Road Warrior will fearlessly lead the way. The attention to detail, from the realistic exterior design to the intricately designed interior, adds to the immersive off-road experience. Get ready to unleash the inner warrior and embark on thrilling off-road journeys!"
   },
   {
      "toyName": "Vintage Blue Coupe",
      "picture": "https://m.media-amazon.com/images/I/71OlJQsk-1S._AC_SL1500_.jpg",
      "price": 54.99,
      "rating": 4.4,
      "category": "vintage-toy-cars",
      "subCategory": "pickups",
      "details": "Experience the elegance and sophistication of the past with the Vintage Blue Coupe toy car. This classic coupe features a stunning blue exterior that captures the essence of timeless beauty. Every detail has been meticulously crafted, from the chrome accents to the sleek curves, making it a true collector's item. Take a step back in time as you imagine cruising down scenic coastal roads or attending glamorous social events. With its smooth performance and iconic design, the Vintage Blue Coupe will transport you to an era of luxury and refinement. Experience the elegance and sophistication of the past with the Vintage Blue Coupe toy car. This classic coupe features a stunning blue exterior that captures the essence of timeless beauty. Every detail has been meticulously crafted, from the chrome accents to the sleek curves, making it a true collector's item. Take a step back in time as you imagine cruising down scenic coastal roads or attending glamorous social events. With its smooth performance and iconic design, the Vintage Blue Coupe will transport you to an era of luxury and refinement."
   },
   {
      "toyName": "Racing Champion",
      "picture": "https://cdn.shopify.com/s/files/1/0400/0910/5560/products/RC014_2020MattHagan_FC_1800x1800.jpg?v=1639150083",
      "price": 79.99,
      "rating": 4.8,
      "category": "racing-toy-cars",
      "subCategory": "speedsters",
      "details": "Get ready to become a racing champion with this high-performance toy car. Engineered for speed and precision, the Racing Champion features a lightweight body, aerodynamic design, and advanced racing technology. The powerful motor and responsive controls allow you to unleash your racing skills and dominate the competition. Whether you're participating in official racing events or organizing thrilling challenges with friends, the Racing Champion is designed to deliver exhilarating speed and unparalleled performance. Are you ready to take your racing prowess to the next level? Get ready to become a racing champion with this high-performance toy car. Engineered for speed and precision, the Racing Champion features a lightweight body, aerodynamic design, and advanced racing technology. The powerful motor and responsive controls allow you to unleash your racing skills and dominate the competition. Whether you're participating in official racing events or organizing thrilling challenges with friends, the Racing Champion is designed to deliver exhilarating speed and unparalleled performance. Are you ready to take your racing prowess to the next level?"
   },
   {
      "toyName": "Off-Road Explorer",
      "picture": "https://ae01.alicdn.com/kf/H9d45543033ed4a31a022d2cb3a93d213f/Remote-Control-Jeep-Car-Toy-RC-Car-Toys-Best-Gifts-for-Boys-Kids.jpg",
      "price": 74.99,
      "rating": 4.7,
      "category": "off-road-toy-cars",
      "subCategory": "warriors",
      "details": "Embark on exciting off-road explorations with the Off-Road Explorer toy car. This versatile and rugged vehicle is built to conquer any terrain, from sandy deserts to dense forests. Its advanced suspension system, four-wheel drive capabilities, and all-terrain tires ensure superior performance and control. Whether you're venturing on solo expeditions or organizing thrilling off-road challenges with friends, the Off-Road Explorer will be your trusted companion in every adventure. Get ready to explore the great outdoors like never before! Embark on exciting off-road explorations with the Off-Road Explorer toy car. This versatile and rugged vehicle is built to conquer any terrain, from sandy deserts to dense forests. Its advanced suspension system, four-wheel drive capabilities, and all-terrain tires ensure superior performance and control. Whether you're venturing on solo expeditions or organizing thrilling off-road challenges with friends, the Off-Road Explorer will be your trusted companion in every adventure. Get ready to explore the great outdoors like never before!"
   },
   {
      "toyName": "Vintage Green Pickup",
      "picture": "https://img.freepik.com/premium-photo/vintage-green-truck-toy-car-made-wood_300903-551.jpg?w=2000",
      "price": 59.99,
      "rating": 4.5,
      "category": "vintage-toy-cars",
      "subCategory": "pickups",
      "details": "Experience the charm of vintage motoring with the Vintage Green Pickup toy car. This classic pickup truck captures the essence of ruggedness and functionality with its sturdy design and iconic silhouette. The attention to detail, from the meticulously painted exterior to the intricately crafted interior, adds to its authentic appeal. Whether you're imagining hauling goods on a rural farm or embarking on a cross-country adventure, the Vintage Green Pickup will transport you to a simpler time filled with exploration and freedom. Experience the charm of vintage motoring with the Vintage Green Pickup toy car. This classic pickup truck captures the essence of ruggedness and functionality with its sturdy design and iconic silhouette. The attention to detail, from the meticulously painted exterior to the intricately crafted interior, adds to its authentic appeal. Whether you're imagining hauling goods on a rural farm or embarking on a cross-country adventure, the Vintage Green Pickup will transport you to a simpler time filled with exploration and freedom."
   },
   {
      "toyName": "Racing Nitro",
      "picture": "https://content.instructables.com/F2O/PZFL/FRXUYST3/F2OPZFLFRXUYST3.jpg?auto=webp",
      "price": 89.99,
      "rating": 4.9,
      "category": "racing-toy-cars",
      "subCategory": "speedsters",
      "details": "Prepare for the ultimate racing experience with the Racing Nitro toy car. Powered by a high-performance nitro engine, this speed demon is built for unmatched speed and acceleration on the racetrack. The aerodynamic body, low profile tires, and advanced suspension system ensure maximum performance and control. Whether you're competing in intense racing championships or organizing adrenaline-pumping challenges with friends, the Racing Nitro will propel you to the forefront of the racing world. Get ready to unleash the power of nitro! Prepare for the ultimate racing experience with the Racing Nitro toy car. Powered by a high-performance nitro engine, this speed demon is built for unmatched speed and acceleration on the racetrack. The aerodynamic body, low profile tires, and advanced suspension system ensure maximum performance and control. Whether you're competing in intense racing championships or organizing adrenaline-pumping challenges with friends, the Racing Nitro will propel you to the forefront of the racing world. Get ready to unleash the power of nitro!"
   },
   {
      "toyName": "Off-Road Dominator",
      "picture": "https://m.media-amazon.com/images/I/617MMBLfLEL._SX355_.jpg",
      "price": 79.99,
      "rating": 4.8,
      "category": "off-road-toy-cars",
      "subCategory": "warriors",
      "details": "Conquer any off-road terrain with the Off-Road Dominator toy car. This rugged and powerful vehicle is built to withstand the most challenging environments. With its aggressive design, oversized tires, and high ground clearance, it dominates rocky mountains, muddy swamps, and sandy dunes with ease. The reinforced chassis and advanced suspension system ensure durability and superior performance. Whether you're embarking on solo adventures or competing in off-road challenges, the Off-Road Dominator will take your off-road experience to new heights. Conquer any off-road terrain with the Off-Road Dominator toy car. This rugged and powerful vehicle is built to withstand the most challenging environments. With its aggressive design, oversized tires, and high ground clearance, it dominates rocky mountains, muddy swamps, and sandy dunes with ease. The reinforced chassis and advanced suspension system ensure durability and superior performance. Whether you're embarking on solo adventures or competing in off-road challenges, the Off-Road Dominator will take your off-road experience to new heights."
   },
   {
      "toyName": "Vintage Silver Coupe",
      "picture": "https://c8.alamy.com/comp/2H51E93/gorgeous-vintage-silver-toy-1960s-model-of-a-porsche-356-sports-car-in-studio-shot-with-white-background-showing-tarnish-2H51E93.jpg",
      "price": 64.99,
      "rating": 4.6,
      "category": "vintage-toy-cars",
      "subCategory": "roadsters",
      "details": "Step back in time with the Vintage Silver Coupe toy car. This classic coupe combines elegance and style with its sleek silver exterior and luxurious interior. The meticulously crafted details, from the polished chrome accents to the plush seats, make it a true collector's item. Its impeccable craftsmanship and intricate details make it a collector's dream. Whether you're taking a leisurely drive or showcasing it in your toy car collection, the Vintage Silver Coupe will evoke a sense of nostalgia and sophistication! Step back in time with the Vintage Silver Coupe toy car. This classic coupe combines elegance and style with its sleek silver exterior and luxurious interior. The meticulously crafted details, from the polished chrome accents to the plush seats, make it a true collector's item. Its impeccable craftsmanship and intricate details make it a collector's dream. Whether you're taking a leisurely drive or showcasing it in your toy car collection, the Vintage Silver Coupe will evoke a sense of nostalgia and sophistication!Step back in time with the Vintage Silver Coupe toy car. This classic coupe combines elegance and style with its sleek silver exterior and luxurious interior. The meticulously crafted details, from the polished chrome accents to the plush seats, make it a true collector's item. Its impeccable craftsmanship and intricate details make it a collector's dream. Whether you're taking a leisurely drive or showcasing it in your toy car collection, the Vintage Silver Coupe will evoke a sense of nostalgia and sophistication!"
   },
   {
      "toyName": "Racing Turbocharged",
      "picture": "https://www.escapistmagazine.com/wp-content/uploads/2023/05/How-Wheels-Unleashed-2-Turbocharged-trailer-release-date.jpg?fit=1024%2C549",
      "price": 89.99,
      "rating": 4.9,
      "category": "racing-toy-cars",
      "subCategory": "supercars",
      "details": "Experience the thrill of turbocharged racing with this high-performance toy car. Equipped with a turbocharged engine and sleek aerodynamics, it's built for speed and agility on the racetrack. The vibrant colors and striking design will make it stand out from the competition. Get ready to unleash the power of the Racing Turbocharged! Experience the thrill of turbocharged racing with this high-performance toy car. Equipped with a turbocharged engine and sleek aerodynamics, it's built for speed and agility on the racetrack. The vibrant colors and striking design will make it stand out from the competition. Get ready to unleash the power of the Racing Turbocharged!Experience the thrill of turbocharged racing with this high-performance toy car. Equipped with a turbocharged engine and sleek aerodynamics, it's built for speed and agility on the racetrack. The vibrant colors and striking design will make it stand out from the competition. Get ready to unleash the power of the Racing Turbocharged!"
   },
   {
      "toyName": "Off-Road Explorer",
      "picture": "https://m.media-amazon.com/images/I/61-d7+-5Y6L.jpg",
      "price": 79.99,
      "rating": 4.7,
      "category": "off-road-toy-cars",
      "subCategory": "monsters",
      "details": "Embark on exciting off-road explorations with this rugged and versatile toy car. Its all-terrain capabilities, including four-wheel drive and high ground clearance, allow it to conquer the toughest trails. Whether you're navigating rocky terrains or venturing through dense forests, the Off-Road Explorer will be your trusted companion in every adventure. Experience the thrill of turbocharged racing with this high-performance toy car. Equipped with a turbocharged engine and sleek aerodynamics, it's built for speed and agility on the racetrack. The vibrant colors and striking design will make it stand out from the competition. Get ready to unleash the power of the Racing Turbocharged!Experience the thrill of turbocharged racing with this high-performance toy car. Equipped with a turbocharged engine and sleek aerodynamics, it's built for speed and agility on the racetrack. The vibrant colors and striking design will make it stand out from the competition. Get ready to unleash the power of the Racing Turbocharged!"
   },
   {
      "toyName": "Vintage Blue Muscle Car",
      "picture": "https://m.media-amazon.com/images/I/61y00xvqQCL.jpg",
      "price": 64.99,
      "rating": 4.6,
      "category": "vintage-toy-cars",
      "subCategory": "roadsters",
      "details": "Take a trip back in time with this vintage blue muscle car toy. Inspired by the iconic American muscle cars of the past, it features a powerful engine, aggressive stance, and attention-grabbing blue paint job. Whether you're imagining high-speed pursuits or reliving classic road trip adventures, the Vintage Blue Muscle Car will ignite your imagination. Take a trip back in time with this vintage blue muscle car toy. Inspired by the iconic American muscle cars of the past, it features a powerful engine, aggressive stance, and attention-grabbing blue paint job. Whether you're imagining high-speed pursuits or reliving classic road trip adventures, the Vintage Blue Muscle Car will ignite your imagination. Take a trip back in time with this vintage blue muscle car toy. Inspired by the iconic American muscle cars of the past, it features a powerful engine, aggressive stance, and attention-grabbing blue paint job. Whether you're imagining high-speed pursuits or reliving classic road trip adventures, the Vintage Blue Muscle Car will ignite your imagination."
   },
   {
      "toyName": "Racing Supercar",
      "picture": "https://m.media-amazon.com/images/I/51t4p0LyW8L.jpg",
      "price": 99.99,
      "rating": 5.0,
      "category": "racing-toy-cars",
      "subCategory": "supercars",
      "details": "Experience the pinnacle of racing performance with this sleek and aerodynamic toy car. Modeled after the world's most iconic supercars, it combines cutting-edge design with top-notch engineering. The attention to detail, from the carbon fiber body panels to the precision-engineered suspension, sets it apart from the competition. Get ready to dominate the racetrack with the Racing Supercar!Experience the pinnacle of racing performance with this sleek and aerodynamic toy car. Modeled after the world's most iconic supercars, it combines cutting-edge design with top-notch engineering. The attention to detail, from the carbon fiber body panels to the precision-engineered suspension, sets it apart from the competition. Get ready to dominate the racetrack with the Racing Supercar!Experience the pinnacle of racing performance with this sleek and aerodynamic toy car. Modeled after the world's most iconic supercars, it combines cutting-edge design with top-notch engineering. The attention to detail, from the carbon fiber body panels to the precision-engineered suspension, sets it apart from the competition. Get ready to dominate the racetrack with the Racing Supercar!"
   },
   {
      "toyName": "Off-Road Monster",
      "picture": "https://m.media-amazon.com/images/I/61PxQyUnv1L.jpg",
      "price": 89.99,
      "rating": 4.9,
      "category": "off-road-toy-cars",
      "subCategory": "monsters",
      "details": "Unleash the power of this off-road monster toy car. With its massive tires, powerful motor, and robust suspension system, it's built to conquer any off-road challenge. From scaling steep inclines to tackling muddy swamps, this beast will push the limits of off-road adventure. Get ready to unleash the Off-Road Monster and dominate the wild terrain!Unleash the power of this off-road monster toy car. With its massive tires, powerful motor, and robust suspension system, it's built to conquer any off-road challenge. From scaling steep inclines to tackling muddy swamps, this beast will push the limits of off-road adventure. Get ready to unleash the Off-Road Monster and dominate the wild terrain!Unleash the power of this off-road monster toy car. With its massive tires, powerful motor, and robust suspension system, it's built to conquer any off-road challenge. From scaling steep inclines to tackling muddy swamps, this beast will push the limits of off-road adventure. Get ready to unleash the Off-Road Monster and dominate the wild terrain!"
   },
   {
      "toyName": "Vintage Yellow Roadster",
      "picture": "https://i.ebayimg.com/images/g/CrUAAOSwxi1ijAXV/s-l1600.jpg",
      "price": 59.99,
      "rating": 4.5,
      "category": "vintage-toy-cars",
      "subCategory": "roadsters",
      "details": "Experience the thrill of open-air motoring with the Vintage Yellow Roadster toy car. This iconic roadster features a vibrant yellow exterior that turns heads wherever you go. Its sleek design, low-slung body, and powerful engine make it the perfect companion for leisurely drives along coastal highways or picturesque country roads. Step into the driver's seat, feel the wind in your hair, and embark on a journey filled with elegance and adventure. Experience the thrill of open-air motoring with the Vintage Yellow Roadster toy car. This iconic roadster features a vibrant yellow exterior that turns heads wherever you go. Its sleek design, low-slung body, and powerful engine make it the perfect companion for leisurely drives along coastal highways or picturesque country roads. Step into the driver's seat, feel the wind in your hair, and embark on a journey filled with elegance and adventure.Experience the thrill of open-air motoring with the Vintage Yellow Roadster toy car. This iconic roadster features a vibrant yellow exterior that turns heads wherever you go. Its sleek design, low-slung body, and powerful engine make it the perfect companion for leisurely drives along coastal highways or picturesque country roads. Step into the driver's seat, feel the wind in your hair, and embark on a journey filled with elegance and adventure."
   },
   {
      "toyName": "Racing Drift King",
      "picture": "https://images-cdn.ubuy.co.in/634d815f932bdd213746def3-goolrc-wltoys-k989-rc-car-1-28-scale.jpg",
      "price": 69.99,
      "rating": 4.8,
      "category": "racing-toy-cars",
      "subCategory": "supercars",
      "details": "Get ready to master the art of drifting with the Racing Drift King toy car. Designed for precision and control, this high-performance racer allows you to slide through corners with style and grace. Its low center of gravity, specialized tires, and adjustable suspension enable you to achieve the perfect drift every time. Whether you're competing in drift competitions or organizing thrilling drift battles, the Racing Drift King will establish your supremacy on the track. Get ready to master the art of drifting with the Racing Drift King toy car. Designed for precision and control, this high-performance racer allows you to slide through corners with style and grace. Its low center of gravity, specialized tires, and adjustable suspension enable you to achieve the perfect drift every time. Whether you're competing in drift competitions or organizing thrilling drift battles, the Racing Drift King will establish your supremacy on the track."
   },
   {
      "toyName": "Off-Road Trailblazer",
      "picture": "https://ae01.alicdn.com/kf/S840a4efda4a548a7919063fcbbf06ca6Z/Diecast-1-24-Scale-Trailblazer-Police-Car-OffRoad-Vehicle-Alloy-Car-Model-Collectibles-Static-Ornament-Gift.jpg",
      "price": 79.99,
      "rating": 4.7,
      "category": "off-road-toy-cars",
      "subCategory": "monsters",
      "details": "Conquer new off-road frontiers with the Off-Road Trailblazer toy car. Built to handle the toughest terrains, this rugged vehicle features a reinforced body, high ground clearance, and all-terrain tires. Whether you're navigating rocky mountain trails or forging through dense jungles, the Off-Road Trailblazer will lead the way. With its powerful motor and durable construction, this off-road beast is ready for any adventure you throw at it. Conquer new off-road frontiers with the Off-Road Trailblazer toy car. Built to handle the toughest terrains, this rugged vehicle features a reinforced body, high ground clearance, and all-terrain tires. Whether you're navigating rocky mountain trails or forging through dense jungles, the Off-Road Trailblazer will lead the way. With its powerful motor and durable construction, this off-road beast is ready for any adventure you throw at it.Conquer new off-road frontiers with the Off-Road Trailblazer toy car. Built to handle the toughest terrains, this rugged vehicle features a reinforced body, high ground clearance, and all-terrain tires. Whether you're navigating rocky mountain trails or forging through dense jungles, the Off-Road Trailblazer will lead the way. With its powerful motor and durable construction, this off-road beast is ready for any adventure you throw at it."
   },
   {
      "toyName": "Vintage Pink Sedan",
      "picture": "https://i.ebayimg.com/images/g/ChgAAOSwkiZjG9Wv/s-l1600.jpg",
      "price": 54.99,
      "rating": 4.4,
      "category": "vintage-toy-cars",
      "subCategory": "sedans",
      "details": "Embrace the elegance of vintage motoring with the Vintage Pink Sedan toy car. This classic sedan showcases a beautiful pink exterior that exudes charm and sophistication. Its spacious interior, comfortable seating, and smooth performance make it perfect for long drives and stylish adventures. Cruise along scenic routes, attend glamorous events, and immerse yourself in the nostalgia of a bygone era with the Vintage Pink Sedan. Embrace the elegance of vintage motoring with the Vintage Pink Sedan toy car. This classic sedan showcases a beautiful pink exterior that exudes charm and sophistication. Its spacious interior, comfortable seating, and smooth performance make it perfect for long drives and stylish adventures. Cruise along scenic routes, attend glamorous events, and immerse yourself in the nostalgia of a bygone era with the Vintage Pink Sedan.Embrace the elegance of vintage motoring with the Vintage Pink Sedan toy car. This classic sedan showcases a beautiful pink exterior that exudes charm and sophistication. Its spacious interior, comfortable seating, and smooth performance make it perfect for long drives and stylish adventures. Cruise along scenic routes, attend glamorous events, and immerse yourself in the nostalgia of a bygone era with the Vintage Pink Sedan."
   },
   {
      "toyName": "Racing Thunderbolt",
      "picture": "https://m.media-amazon.com/images/I/718ZgQ3GkeL._AC_UF894,1000_QL80_.jpg",
      "price": 89.99,
      "rating": 4.9,
      "category": "racing-toy-cars",
      "subCategory": "thunderbolts",
      "details": "Unleash the power of lightning with the Racing Thunderbolt toy car. Engineered for speed and performance, this lightning-fast racer will leave your competitors in awe. With its streamlined body, high-performance tires, and advanced aerodynamics, it cuts through the air with unmatched precision. Whether you're racing on the track or organizing intense time trials, the Racing Thunderbolt will electrify your racing experience. Unleash the power of lightning with the Racing Thunderbolt toy car. Engineered for speed and performance, this lightning-fast racer will leave your competitors in awe. With its streamlined body, high-performance tires, and advanced aerodynamics, it cuts through the air with unmatched precision. Whether you're racing on the track or organizing intense time trials, the Racing Thunderbolt will electrify your racing experience."
   },
   {
      "toyName": "Off-Road Baja Beast",
      "picture": "https://www.rcmania.com/maisto-tech-baja-beast/maisto-tech-baja-beast.jpg",
      "price": 84.99,
      "rating": 4.8,
      "category": "off-road-toy-cars",
      "subCategory": "recons",
      "details": "Tame the wild with the Off-Road Baja Beast toy car. Inspired by the ruggedness of Baja off-road racing, this beastly vehicle is built to conquer challenging terrains with ease. Its robust suspension, high-performance shocks, and all-terrain tires enable it to handle anything from sand dunes to rocky trails. Prepare to unleash the power of the Off-Road Baja Beast and dominate the off-road landscape. Tame the wild with the Off-Road Baja Beast toy car. Inspired by the ruggedness of Baja off-road racing, this beastly vehicle is built to conquer challenging terrains with ease. Its robust suspension, high-performance shocks, and all-terrain tires enable it to handle anything from sand dunes to rocky trails. Prepare to unleash the power of the Off-Road Baja Beast and dominate the off-road landscape.Tame the wild with the Off-Road Baja Beast toy car. Inspired by the ruggedness of Baja off-road racing, this beastly vehicle is built to conquer challenging terrains with ease. Its robust suspension, high-performance shocks, and all-terrain tires enable it to handle anything from sand dunes to rocky trails. Prepare to unleash the power of the Off-Road Baja Beast and dominate the off-road landscape."
   },
   {
      "toyName": "Vintage Red Convertible",
      "picture": "https://c8.alamy.com/comp/GJR7TH/toy-car-with-driver-GJR7TH.jpg",
      "price": 64.99,
      "rating": 4.6,
      "category": "vintage-toy-cars",
      "subCategory": "sedans",
      "details": "Feel the joy of open-top motoring with the Vintage Red Convertible toy car. This classic convertible captures the essence of freedom and style with its vibrant red exterior and timeless design. Whether you're cruising along coastal roads or enjoying a sunny day in the countryside, the Vintage Red Convertible will transport you to a world of carefree adventure and unforgettable memories. Feel the joy of open-top motoring with the Vintage Red Convertible toy car. This classic convertible captures the essence of freedom and style with its vibrant red exterior and timeless design. Whether you're cruising along coastal roads or enjoying a sunny day in the countryside, the Vintage Red Convertible will transport you to a world of carefree adventure and unforgettable memories.Feel the joy of open-top motoring with the Vintage Red Convertible toy car. This classic convertible captures the essence of freedom and style with its vibrant red exterior and timeless design. Whether you're cruising along coastal roads or enjoying a sunny day in the countryside, the Vintage Red Convertible will transport you to a world of carefree adventure and unforgettable memories."
   },
   {
      "toyName": "Racing Velocity",
      "picture": "https://static2.mumzworld.com/media/catalog/product/a/l/al-crc136-power-joy-rc-f1-racing-car-1-12-assorted-1pc-16455341761.jpg",
      "price": 94.99,
      "rating": 4.9,
      "category": "racing-toy-cars",
      "subCategory": "thunderbolts",
      "details": "Experience the thrill of pure speed with the Racing Velocity toy car. Engineered for adrenaline-pumping racing, this high-performance machine is designed to leave competitors in the dust. With its sleek body, high-speed tires, and advanced aerodynamics, it's built to reach incredible velocities on the racetrack. Whether you're competing in professional racing events or organizing high-speed challenges, the Racing Velocity will push the boundaries of speed and performance. Experience the thrill of pure speed with the Racing Velocity toy car. Engineered for adrenaline-pumping racing, this high-performance machine is designed to leave competitors in the dust. With its sleek body, high-speed tires, and advanced aerodynamics, it's built to reach incredible velocities on the racetrack. Whether you're competing in professional racing events or organizing high-speed challenges, the Racing Velocity will push the boundaries of speed and performance."
   },
   {
      "toyName": "Off-Road Warrior",
      "picture": "https://us03-imgcdn.ymcart.com/46188/2021/08/02/6/a/6a192e7b7c84532a.jpg?x-oss-process=image/quality,Q_90/auto-orient,1/resize,m_lfit,w_500,h_500",
      "price": 79.99,
      "rating": 4.8,
      "category": "off-road-toy-cars",
      "subCategory": "recons",
      "details": "Conquer the off-road battlefield with the Off-Road Warrior toy car. This rugged and formidable vehicle is built to endure the harshest environments and overcome any obstacle in its path. Its reinforced body, aggressive tires, and powerful motor make it a force to be reckoned with. Whether you're embarking on extreme off-road adventures or organizing off-road challenges, the Off-Road Warrior will lead you to victory. Conquer the off-road battlefield with the Off-Road Warrior toy car. This rugged and formidable vehicle is built to endure the harshest environments and overcome any obstacle in its path. Its reinforced body, aggressive tires, and powerful motor make it a force to be reckoned with. Whether you're embarking on extreme off-road adventures or organizing off-road challenges, the Off-Road Warrior will lead you to victory."
   },
   {
      "toyName": "Vintage Purple Hot Rod",
      "picture": "https://i.ebayimg.com/images/g/BWkAAOSw9kZhviAV/s-l1600.jpg",
      "price": 69.99,
      "rating": 4.7,
      "category": "vintage-toy-cars",
      "subCategory": "sedans",
      "details": "Rev up the nostalgia with the Vintage Purple Hot Rod toy car. Inspired by the iconic hot rods of the past, this eye-catching purple beauty combines style and performance in one package. Its powerful engine, custom paint job, and chrome accents make it a head-turner wherever it goes. Whether you're participating in classic car shows or staging thrilling drag races, the Vintage Purple Hot Rod will ignite your passion for vintage speed. Rev up the nostalgia with the Vintage Purple Hot Rod toy car. Inspired by the iconic hot rods of the past, this eye-catching purple beauty combines style and performance in one package. Its powerful engine, custom paint job, and chrome accents make it a head-turner wherever it goes. Whether you're participating in classic car shows or staging thrilling drag races, the Vintage Purple Hot Rod will ignite your passion for vintage speed."
   },
   {
      "toyName": "Racing Nitro Blitz",
      "picture": "https://i0.wp.com/circusrc.com/CRC/wp-content/uploads/2021/01/Blitz-Spider-18th-On-road-body.jpg?fit=1024%2C512&ssl=1?v=1611051964",
      "price": 99.99,
      "rating": 5.0,
      "category": "racing-toy-cars",
      "subCategory": "thunderbolts",
      "details": "Prepare for explosive speed with the Racing Nitro Blitz toy car. Equipped with a powerful nitro-fueled engine, this adrenaline-fueled racer delivers mind-blowing acceleration and blistering top speeds. Its sleek design, high-grip tires, and advanced aerodynamics ensure optimal performance on the racetrack. Whether you're competing in high-stakes races or organizing jaw-dropping speed challenges, the Racing Nitro Blitz will take your racing experience to the next level. Prepare for explosive speed with the Racing Nitro Blitz toy car. Equipped with a powerful nitro-fueled engine, this adrenaline-fueled racer delivers mind-blowing acceleration and blistering top speeds. Its sleek design, high-grip tires, and advanced aerodynamics ensure optimal performance on the racetrack. Whether you're competing in high-stakes races or organizing jaw-dropping speed challenges, the Racing Nitro Blitz will take your racing experience to the next level."
   },
   {
      "toyName": "Off-Road Recon",
      "picture": "https://m.media-amazon.com/images/I/51G1a3-JzWL._SY355_.jpg",
      "price": 74.99,
      "rating": 4.6,
      "category": "off-road-toy-cars",
      "subCategory": "recons",
      "details": "Embark on daring off-road missions with the Off-Road Recon toy car. Built for adventure and exploration, this versatile vehicle features a robust suspension, all-terrain tires, and powerful headlights to light up the darkest trails. Whether you're conquering rocky mountains or venturing into uncharted territories, the Off-Road Recon will be your reliable companion in every off-road escapade. Embark on daring off-road missions with the Off-Road Recon toy car. Built for adventure and exploration, this versatile vehicle features a robust suspension, all-terrain tires, and powerful headlights to light up the darkest trails. Whether you're conquering rocky mountains or venturing into uncharted territories, the Off-Road Recon will be your reliable companion in every off-road escapade.Embark on daring off-road missions with the Off-Road Recon toy car. Built for adventure and exploration, this versatile vehicle features a robust suspension, all-terrain tires, and powerful headlights to light up the darkest trails. Whether you're conquering rocky mountains or venturing into uncharted territories, the Off-Road Recon will be your reliable companion in every off-road escapade."
   }
]